#pragma once

#ifndef _TEXT_
#define _TEXT_

#include<stdio.h>
#include<stdlib.h>
#include"Sub.h"

//scene数
#define Total_Scene 200
#define SELMSG 4
#define MSGT 256
#define ENDMSGT 30
#define LOG 900

//構造体でシーン管理
struct SCE
{
	int  nn;
	char td[MSGT];
	int  next;
	int  hk;
	int  bgm;
	int  cg;
	int  sceneN;
	bool self;
	char selt[SELMSG][MSGT];
	int  jampN[SELMSG];
};

SCE data[Total_Scene] = { 

#pragma region オープニング
	//タイトル画面
	{0,"",1,Opning,Op,-1,-1,true,"load","初めから","遊び方","",-1,1,140},
	
#pragma endregion

#pragma region 説明
	{1,"ようこそ",2,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{2,"今から全５問の問題を出すよ",3,kyou,bone,Pl,-1,false,"","","","",-1,-1,-1,-1},
	{3,"選択肢から自分が聞きたい質問を選んで",4,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{4,"出来るだけ質問数を少なくして\n高得点をとるんだ",5,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{5,"では1門目を行くよ",6,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
#pragma endregion

#pragma region 第一門
	{6,"男『チョコレート７個しか入ってない…』\n男はとても困った。一体なぜ？",7,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{7,"さぁ聞きたいことはどれかな",7,kyou,bone,Pl,-1,true,"それはバレンタインが関係ある？","男のほかにも誰かいた？","チョコが入っていたのは何？","解答へ行く",8,10,12,14},
	{8,"うん\nこれはバレンタインに起きた事件だよ",9,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{9,"うらやましいけど可哀そうがヒントだよ",7,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{10,"男は一人かもしれないし\n他にもいたかもしれない",11,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{11,"人数はあんまり関係ないよ",7,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{12,"チョコは下駄箱に入っていたよ",13,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{13,"水平思考クイズっぽい質問じゃないけど仕方ないね",7,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{14,"",14,kyou,bone,Pl,-1,true,"上靴がなかった","旅行のお見上げが社員分なかった","女性が用意した頭数に入っていなかった","",15,17,17},
	{15,"正解",16,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{16,"解答ストーリーだよ",19,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{17,"残念",18,kyou,bone,Pl,-1,false,"もう一度回答する","もう一度回答する","","",14,18,18},
	{18,"どうする？",19,kyou,bone,Pl,-1,true,"もう一度回答する","質問に戻る","解答を見る","",14,7,19},
	{19,"２月14日。いつもの様に登校したカメオが下駄箱を開けると、\nそこには７箱のチョコレートが入っていた。",20,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{20,"男は下駄箱の奥まで覗き込んだのだが...",21,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{21,"『チョコレート７個“しか”入ってない...俺の上履きがない..』",22,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{22,"いかがだったかな、それじゃあ評価を見てみよう",23,kyou,bone,Pl,-1,false,"","","",-1,-1,-1},
	{23,"",24,0,bone,0,-1,false,"","","",-1,-1,-1},
#pragma endregion

#pragma region 第二問

	{24,"一問目はどうだった？",25,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{25,"早速だが二問目だ！",26,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{26,"俺は、辺りに毒キノコしかないのを見て安堵したんだ！\n何でだと思う！？",27,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{27,"さぁ！な・に・を質問する！？",28,ura,btwo,Yu2,-1,true,"その時どんな状況だった？","キノコに詳しいの？","毒に耐性でもあるの？","答えてやるよ",28,30,32,34},
	{28,"そん時は遭難していたんだよ！\nシャレになんなかったぜ",29,ura,btwo,Yu2,-1,false,"","","","",-1,-1},
	{29,"おまけに食料もなかったんだ",27,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{30,"まぁな！\n昔からばぁちゃんに鍛えられてたんだ！",31,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{31,"おかげで就活もおわちまったよ！",27,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{32,"聞くがお前魚が陸で歩けると思うか？",33,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{33,"そういうことだよ！",27,ura,btwo,Yu2,-1,false,"","","","",-1,-1},
	{34,"聞かせてみろよ...",35,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{35,"",36,ura,btwo,Yu2,-1,true,"毒キノコはあぶれば食べれるものだった","キノコ職人が来たのを悟った","クマの撃退に使えた","おまえじつはどくきかん",36,38,36,36},
	{36,"hahahaha残念だったな～？？",37,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{37,"おらもっかい考えていいぜ？？",38,ura,btwo,Yu2,-1,true,"もう一度回答する","質問に戻る","解答を見る","",35,27,39},
	{38,"て..天才か...？？？\nそうだ答えは",40,ura,btwo,Yu2,-1,false,"","","","",-1,-1},
	{39,"あきらめんのかよ～ま、そうだわなww",40,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{40,"事故って帰り道がわからなくなってな、\n山の中を彷徨ってたんだ",41,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{41,"何日か経って毒キノコしかないとこに出てよ",42,ura,btwo,Yu2,-1,false,"","","","",-1,-1},
	{42,"そこを拠点にしたんだ\nこの辺りには職人が来てると思ったからな",43,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},
	{43,"",44,ura,btwo,Yu2,-1,false,"","","",-1,-1,-1},

#pragma endregion

#pragma region 第三問

	{44,"こんにちわ、ここまでの問題はちゃんと解けた？",45,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{45,"少し難易度を上げるわね",46,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{46,"私の村の近くにある、『出る』と噂の不気味な林道。そこにはある一つのルールが存在するの",47,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{47,"その林道で、『もし一人ぼっちで歌う少女を見かけたら、絶対に関わってはいけない』というものよ。なぜそんなルールが存在すると思う？",48,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{48,"逆転の発想で考えてみてね\nじゃあ質問をどうぞ",49,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{49,"",50,rouka,bthree,Yu1,-1,true,"出るのは本当？","少女は幽霊？","ルールは村人が決めたの？","次の質問へ行く",51,53,55,50},
	{50,"",51,rouka,bthree,Yu1,-1,true,"少女は林道に行かなければいけないの？","村人は少女の霊を知っているの？","前の質問へ戻る","解答へ行く",57,59,49,61},
	{51,"本当よ",52,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{52,"とはいっても知ったのは大人になってからだけどね\n他の質問は？",49,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{53,"いいえ",54,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{54,"少女は子供のころの私よ\n他の質問は？",49,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{55,"違うわ、いい質問ね",56,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{56,"人だった存在よ\n他の質問は？",49,rouka,bthree,Yu1,-1,false,"","","","",-1,-1,-1},
	{57,"えぇ",58,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{58,"そこに母のお墓があるのよ...\nもうわかったかしら",49,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{59,"いいえ、少女は大切にされていたわよ",60,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{60,"母親を亡くしたか弱い少女だもの\n他の質問は？",49,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{61,"答えてみなさい...",62,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{62,"",63,rouka,bthree,Yu1,-1,true,"村人は子供を林道に入れたくなかった","少女はいじめられていた","少女を怖がらせないために","解答を見る",64,64,66,63},
	{63,"お手上げなのね",67,rouka,bthree,Yu1,-1,false,"","","","",-1,-1,-1},
	{64,"違うわ..",65,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{65,"どうする？もう一度考えてみる？",62,rouka,bthree,Yu1,-1,true,"もう一度回答する","質問に戻る","解答を見る","",62,49,63},
	{66,"正解よ,,さすがね\n起きたことはこうよ",67,rouka,bthree,Yu1,-1,false,"","","",-1,-1,-1},
	{67,"私は村に住む一人の娘だった、幼いころに母親を亡くし毎日墓場まで林道を歩いていたの",68,rouka,bthree,Yu1,-1,false,"","","","",-1,-1,-1},
	{68,"その道の途中私は怖くなって歌をよく歌っていたわ",69,rouka,bthree,Yu1,-1,false,"","","","",-1,-1,-1},
	{69,"この問題の答えは幽霊たちは幼い私を驚かせないように気を使ってそんなルールを作ったのよ",70,rouka,bthree,Yu1,-1,false,"","","","",-1,-1,-1},
	{70,"......       \nほら早く次の問題に行きなさい....",71,rouka,bthree,Yu1,-1,false,"","","","",-1,-1,-1},
	{71,"",72,rouka,bthree,Yu1,-1,false,"","","","",-1,-1,-1},
#pragma endregion

#pragma region 第四問

	{72,"よぉ\nとっておきのを持って待ってたぜ",73,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{73,"噂じゃ相当頭が切れるらしいな、じゃ早速始めるか",74,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{74,"知らない男に脅された女は笑顔になって男にプレゼントを贈った\nなんでだと思う？何でも聞いてくれ",75,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{75,"",76,geta,bfor,Yn,-1,true,"男は犯罪を犯している？","2人の年齢は重要？","プレゼントは食べ物？","次の質問を見る",77,79,81,76},
	{76,"",77,geta,bfor,Yn,-1,true,"女は脅されてびっくりした？","プレゼントしたのは男にだけ？","前の質問に戻る","解答する",83,85,75,87},
	{77,"いや犯罪じゃねぇな、俺から見たらって意味でもねぇぞ？",78,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{78,"もっと他にも聞いて来いよ",75,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{79,"あぁ確かにそうだなどっちかが年上で、どっちかが年下だ",80,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{80,"答え方がバカみてぇだな、まぁいいか",75,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{81,"そうだ、あんまり俺は食べねぇな",82,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{82,"おっとこれは関係ねーな",75,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{83,"ケースバイケースだな",84,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{84,"男が頑張ってりゃ驚いたふりはするかもな",75,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{85,"いやその日はいろんな奴にあげてたぜ",86,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{86,"この言い方じゃまるで尻軽みたいだな",75,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{87,"聞いてやろうじゃねぇか",88,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{88,"",89,geta,bfor,Yn,-1,true,"ドッキリの出演による差し入れ","フラッシュモブのお返し","ハロウィンのお返し","解答を見る",89,89,93,92},
	{89,"いやちげぇな～、なんだおまえ\nあんまりたいしたことねぇな",90,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{90,"なんだもう一回挑戦するか？",91,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{91,"",92,geta,bfor,Yn,-1,true,"もう一度回答する","質問に戻る","解答を見る","",88,75,92},
	{92,"なんだもう音を上げたのか？\nしゃぁねぇな～じゃあ言うぞ？",93,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{93,"おまえもガキの頃近所のおばさんに言いに行ったろ？",94,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{94,"答えはハロウィンだ\nがきんちょが楽しそうに脅してるの見て気づいたんだよ",95,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{95,"俺がやったら犯罪者じゃねぇかってな...\nいまはどうかわからんがな\nまぁいい結果見てみな",96,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
	{96,"",97,geta,bfor,Yn,-1,false,"","","",-1,-1,-1},
#pragma endregion 

#pragma region 第五問

	{97,"よく来たね\nここが最終問題だよ",98,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{98,"最後にふさわしい問題を用意したわ\n頑張って..解いてね",99,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{99,"この高校の織田先生が顧問を務める数学同好会では、去り行く三年生が最後に必ず解かされる問題があるの。",100,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{100,"その問題の答えを求めて...\nそして..いえそれは後よ\n質問してきなさい",101,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{101,"",102,koumon,bfive,He,-1,true,"この高校ならでは？","三年生じゃないと解けない？","織田先生は関係ある？","次の質問を見る",103,105,107,102},
    {102,"",103,koumon,bfive,He,-1,true,"場所は重要？","三年生は嫌がる？","前の質問に戻る","最後の解答をする",109,111,101,113},
	{103,"いや、そんなに賢い問題出せないよあの人は",104,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{104,"....",101,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{105,"誰でも解けるから安心して\nそんな難しい問題は出さないよ",106,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{106,"あなたも解いたことあるかも...",101,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{107,"ううん織田先生だからってわけじゃないね",108,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{108,"確かに小粋な人だけど",101,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{109,"人によると思うよ\n私たちも結構こだわったから",110,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{110,"ノートなんか必要ないしね",101,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{111,"みんな楽しそうだったよ",112,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{112,"もちろん私も",101,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{113,"うん！聞かせて！",114,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{114,"",115,koumon,bfive,He,-1,true,"2だよ","ピース","","",115,115,-1},
	{115,"そう...思い出した？",116,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{116,"",117,koumon,bfive,He,-1,true,"思い出した？","何のこと？","","",117,117,-1},
	{117,"じゃあこれがエクストラ問題だね",118,koumon,bfive,He,-1,false,"","","",-1,-1,-1},
	{118,"あなたは記憶を失っています\n失われた記憶ではどんなことが起きたでしょうか？",119,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{119,"",120,koumon,lust,He,-1,true,"今までのみんなが関係する？","顔が見えないのと関係ある？","みんなの言動もヒント？","次の質問へ行く",122,123,124,120},
	{120,"",121,koumon,lust,He,-1,true,"僕も数学同好会の一員だった？","記念写真を撮ったのは..","前の質問に行く","次の質問に行く",125,126,119,121},
	{121,"",122,koumon,lust,He,-1,true,"帰り道に何かあった？","僕は生きている？","前の質問に行く","これで..終わり",127,128,120,130},
	{122,"もちろん\nずっと仲良かったんだよ？",119,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{123,"へぇ～今見えないんだ\nきっといつか思い出してね？",119,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{124,"そうだね特にあなたに出会った三人目なんてドジしたんだから",119,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{125,"そうだよ..いっぱい思い出ある高校生活だよ？",119,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{126,"うん\nさっきの問題はあなたが記憶をなくす前の最後の問題",119,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{127,"新聞にも取り上げられてたね",119,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{128,"大丈夫\nでもそれはあなた次第",119,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{129,"じゃあ聞かせて何があったのか",130,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{130,"",131,koumon,lust,He,-1,true,"バスで僕が死んだ","織田先生が亡くなった","僕以外のみんなが亡くなった","わからない",131,131,136,132},
	{131,"え、ちがうよ？",130,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{132,"そうだね..それが君の答えなら\nそれも正解じゃないかな？それでもいいの？",133,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{133,"",134,koumon,lust,He,-1,true,"うん","いやだ","",134,135,-1},
	{134,"そっか...      \nそれじゃあまたいつかね...",142,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{135,"うん！もう少し頑張って！！",130,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{136,"そうなの　ごめんね\nでも大丈夫！君だけじゃなくて織田先生も生きてるから\n",137,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{137,"数学ではないけど、また君に問題出したかったんだ！\nきっといろいろ後悔すると思うけど",138,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{138,"君だけが生き残った理由がきっといつか出てくるから",139,koumon,lust,He,-1,false,"","","",-1,-1,-1},
	{139,"またどこかで...",142,koumon,lust,He,-1,false,"","","",-1,-1,-1},

#pragma endregion

#pragma region イベントシーン

	//遊び方画面 
	{140,"",0,asobi,Op,-1,-1,false,"","","",-1,-1,-1},
	
	//エスケープ処理 
	{141,"",0,endg,-1,Pl,-1,false,"はい","いいえ","",-1,-1,-1},

	//エンディング画面 
	{142,"",-1,Black,End,-1,-1,false,"","","",-1,-1,-1},

#pragma endregion
};

//エンドロール
struct ENDROLL
{
	char e[MSGT];
}endroll[ENDMSGT] = {
	{"Fhoto"},
	{"   "},
	{"背景写真補完の会"},
	{"三日月アルペジオ"},
	{"空想曲線"},
	{"   "},
	{"music"},
	{"   "},
	{"SYNDROME"},
	{"OMG"},
	{"   "},
	{"Advisor"},
	{"Ota Kouki"},
	{"   "},
	{"   "},
	{"Director"},
	{"Sasou Junya"},
	{"   "},
	{"   "},
	{"   "},
	{"   "},
	{"   "},
	{"   "},
	{"THANK YOU FOR"},
	{"PLAYING"},
};

#pragma region 構造体変数

SCE null_data = {0,"",0.0,0,0,0,false,"","","","",0,0,0,0 };
int back_no = 0;
int now_no = 0;
int bgm_no = 0;
SCE back_data = null_data;
SCE now_data = data[now_no];
SCE bgm_data = data[bgm_no];

#pragma endregion

#endif // !_TEXT_

